Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0064GPM036.PIC
      <edc:AdjustPoint edc:_addr="0x1F800490" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x1F800500" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP5CON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="CCP5CON1" edc:nzwidth="0x20" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOD" edc:desc="" edc:mask="0xf" edc:name="MOD" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="CCSEL" edc:desc="" edc:mask="0x1" edc:name="CCSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRPS" edc:desc="" edc:mask="0x3" edc:name="TMRPS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x7" edc:name="CLKSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TMRSYNC" edc:desc="" edc:mask="0x1" edc:name="TMRSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPSLP" edc:desc="" edc:mask="0x1" edc:name="CCPSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1f" edc:name="SYNC" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="ALTSYNC" edc:desc="" edc:mask="0x1" edc:name="ALTSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="" edc:mask="0x1" edc:name="ONESHOT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPS" edc:desc="" edc:mask="0xf" edc:name="OPS" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTRGEN" edc:desc="" edc:mask="0x1" edc:name="RTRGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPSSRC" edc:desc="" edc:mask="0x1" edc:name="OPSSRC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CCP 5" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800510" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="n------nnn-nnnnnnn-n----nnnnnnnn" edc:cname="CCP5CON2" edc:desc="" edc:impl="0x81dfd0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------100-0000000-0----00000000" edc:name="CCP5CON2" edc:nzwidth="0x20" edc:por="0------100-0000000-0----00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASDG" edc:desc="" edc:mask="0xff" edc:name="ASDG" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SSDG" edc:desc="" edc:mask="0x1" edc:name="SSDG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ASDGM" edc:desc="" edc:mask="0x1" edc:name="ASDGM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMRSEN" edc:desc="" edc:mask="0x1" edc:name="PWMRSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICS" edc:desc="" edc:mask="0x7" edc:name="ICS" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="AUXOUT" edc:desc="" edc:mask="0x3" edc:name="AUXOUT" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGSM" edc:desc="" edc:mask="0x3" edc:name="ICGSM" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OCAEN" edc:desc="" edc:mask="0x1" edc:name="OCAEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OENSYNC" edc:desc="" edc:mask="0x1" edc:name="OENSYNC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800520" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="nnnn------n-nn------------------" edc:cname="CCP5CON3" edc:desc="" edc:impl="0xf02c1000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000------0-00------------------" edc:name="CCP5CON3" edc:nzwidth="0x20" edc:por="0000------0-00------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="PSSACE" edc:desc="" edc:mask="0x3" edc:name="PSSACE" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="POLACE" edc:desc="" edc:mask="0x1" edc:name="POLACE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OSCNT" edc:desc="" edc:mask="0x7" edc:name="OSCNT" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="OETRIG" edc:desc="" edc:mask="0x1" edc:name="OETRIG" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800530" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="-----------nnnnn-----n--rnnccrcr" edc:cname="CCP5STAT" edc:desc="" edc:impl="0x301f14ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000-----0--00000000" edc:name="CCP5STAT" edc:nzwidth="0x20" edc:por="-----------00000-----0--00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:desc="" edc:mask="0x1" edc:name="ICDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCEVT" edc:desc="" edc:mask="0x1" edc:name="SCEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ASEVT" edc:desc="" edc:mask="0x1" edc:name="ASEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRCLR" edc:desc="" edc:mask="0x1" edc:name="TRCLR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRSET" edc:desc="" edc:mask="0x1" edc:name="TRSET" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPTRIG" edc:desc="" edc:mask="0x1" edc:name="CCPTRIG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGARM" edc:desc="" edc:mask="0x1" edc:name="ICGARM" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RAWIP" edc:desc="" edc:mask="0x1" edc:name="RAWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RBWIP" edc:desc="" edc:mask="0x1" edc:name="RBWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRLWIP" edc:desc="" edc:mask="0x1" edc:name="TMRLWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRHWIP" edc:desc="" edc:mask="0x1" edc:name="TMRHWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PRLWIP" edc:desc="" edc:mask="0x1" edc:name="PRLWIP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
