Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0064GPM036.PIC
      <edc:SFRDef edc:_addr="0x1F800540" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP5TMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP5TMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMRL" edc:desc="" edc:mask="0xffff" edc:name="TMRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="TMRH" edc:desc="" edc:mask="0xffff" edc:name="TMRH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xffffffff" edc:name="TMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800550" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP5PR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP5PR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PRL" edc:desc="" edc:mask="0xffff" edc:name="PRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="PRH" edc:desc="" edc:mask="0xffff" edc:name="PRH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xffffffff" edc:name="PR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800560" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CCP5RA" edc:desc="" edc:impl="0x3000ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CCP5RA" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPA" edc:desc="" edc:mask="0xffff" edc:name="CMPA" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800570" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CCP5RB" edc:desc="" edc:impl="0x3000ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CCP5RB" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPB" edc:desc="" edc:mask="0xffff" edc:name="CMPB" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800580" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP5BUF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP5BUF" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUFL" edc:desc="" edc:mask="0xffff" edc:name="BUFL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="BUFH" edc:desc="" edc:mask="0xffff" edc:name="BUFH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="BUF" edc:desc="" edc:mask="0xffffffff" edc:name="BUF" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800590" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x1F800600" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="6" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP6CON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="CCP6CON1" edc:nzwidth="0x20" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CCP6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOD" edc:desc="" edc:mask="0xf" edc:name="MOD" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="CCSEL" edc:desc="" edc:mask="0x1" edc:name="CCSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRPS" edc:desc="" edc:mask="0x3" edc:name="TMRPS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x7" edc:name="CLKSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TMRSYNC" edc:desc="" edc:mask="0x1" edc:name="TMRSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPSLP" edc:desc="" edc:mask="0x1" edc:name="CCPSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1f" edc:name="SYNC" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="ALTSYNC" edc:desc="" edc:mask="0x1" edc:name="ALTSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="" edc:mask="0x1" edc:name="ONESHOT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPS" edc:desc="" edc:mask="0xf" edc:name="OPS" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTRGEN" edc:desc="" edc:mask="0x1" edc:name="RTRGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPSSRC" edc:desc="" edc:mask="0x1" edc:name="OPSSRC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CCP 6" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800610" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="6" edc:access="n------nnn-nnnnnnn-n----nnnnnnnn" edc:cname="CCP6CON2" edc:desc="" edc:impl="0x81dfd0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------100-0000000-0----00000000" edc:name="CCP6CON2" edc:nzwidth="0x20" edc:por="0------100-0000000-0----00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP6">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASDG" edc:desc="" edc:mask="0xff" edc:name="ASDG" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SSDG" edc:desc="" edc:mask="0x1" edc:name="SSDG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ASDGM" edc:desc="" edc:mask="0x1" edc:name="ASDGM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMRSEN" edc:desc="" edc:mask="0x1" edc:name="PWMRSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICS" edc:desc="" edc:mask="0x7" edc:name="ICS" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="AUXOUT" edc:desc="" edc:mask="0x3" edc:name="AUXOUT" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGSM" edc:desc="" edc:mask="0x3" edc:name="ICGSM" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OCAEN" edc:desc="" edc:mask="0x1" edc:name="OCAEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OENSYNC" edc:desc="" edc:mask="0x1" edc:name="OENSYNC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
