Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0064GPM036.PIC
      <edc:SFRDef edc:_addr="0x1F802290" edc:_begin="0x200" edc:_end="0x250" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="2" edc:access="------------------------nnnnnnnn" edc:cname="AD1CHS" edc:desc="" edc:impl="0x7070ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="AD1CHS" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CH0SA" edc:desc="" edc:mask="0x1f" edc:name="CH0SA" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="CH0NA" edc:mask="0x7" edc:name="CH0NA" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8022A0" edc:_begin="0x200" edc:_end="0x250" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AD1CSS" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="AD1CSS" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS0" edc:desc="" edc:mask="0x1" edc:name="CSS0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS1" edc:desc="" edc:mask="0x1" edc:name="CSS1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS2" edc:desc="" edc:mask="0x1" edc:name="CSS2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS3" edc:desc="" edc:mask="0x1" edc:name="CSS3" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS4" edc:desc="" edc:mask="0x1" edc:name="CSS4" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS5" edc:desc="" edc:mask="0x1" edc:name="CSS5" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS6" edc:desc="" edc:mask="0x1" edc:name="CSS6" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS7" edc:desc="" edc:mask="0x1" edc:name="CSS7" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS8" edc:desc="" edc:mask="0x1" edc:name="CSS8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS9" edc:desc="" edc:mask="0x1" edc:name="CSS9" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS10" edc:desc="" edc:mask="0x1" edc:name="CSS10" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS11" edc:desc="" edc:mask="0x1" edc:name="CSS11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS12" edc:desc="" edc:mask="0x1" edc:name="CSS12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS13" edc:desc="" edc:mask="0x1" edc:name="CSS13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS14" edc:desc="" edc:mask="0x1" edc:name="CSS14" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS15" edc:desc="" edc:mask="0x1" edc:name="CSS15" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS16" edc:desc="" edc:mask="0x1" edc:name="CSS16" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS17" edc:desc="" edc:mask="0x1" edc:name="CSS17" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS18" edc:desc="" edc:mask="0x1" edc:name="CSS18" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS19" edc:desc="" edc:mask="0x1" edc:name="CSS19" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS20" edc:desc="" edc:mask="0x1" edc:name="CSS20" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS21" edc:desc="" edc:mask="0x1" edc:name="CSS21" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS22" edc:desc="" edc:mask="0x1" edc:name="CSS22" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS23" edc:desc="" edc:mask="0x1" edc:name="CSS23" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS24" edc:desc="" edc:mask="0x1" edc:name="CSS24" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS25" edc:desc="" edc:mask="0x1" edc:name="CSS25" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS26" edc:desc="" edc:mask="0x1" edc:name="CSS26" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS27" edc:desc="" edc:mask="0x1" edc:name="CSS27" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS28" edc:desc="" edc:mask="0x1" edc:name="CSS28" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS29" edc:desc="" edc:mask="0x1" edc:name="CSS29" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS30" edc:desc="" edc:mask="0x1" edc:name="CSS30" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSS31" edc:desc="" edc:mask="0x1" edc:name="CSS31" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8022B0" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F8022C0" edc:_begin="0x260" edc:_end="0x280" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="3" edc:access="----------------nn-n--nn----nnnn" edc:cname="AD1CON5" edc:desc="" edc:impl="0xd30f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00-0--00----0000" edc:name="AD1CON5" edc:nzwidth="0x20" edc:por="----------------00-0--00----0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CM" edc:desc="" edc:mask="0x3" edc:name="CM" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="WM" edc:desc="" edc:mask="0x3" edc:name="WM" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASINT" edc:desc="" edc:mask="0x3" edc:name="ASINT" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="BGREQ" edc:desc="" edc:mask="0x1" edc:name="BGREQ" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LPEN" edc:desc="" edc:mask="0x1" edc:name="LPEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ASEN" edc:desc="" edc:mask="0x1" edc:name="ASEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8022D0" edc:_begin="0x260" edc:_end="0x280" edc:_modsrc="DOS-02805_adc_sib_upb_v1_32bit.Module" edc:_refcount="3" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="AD1CHIT" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="AD1CHIT" edc:nzwidth="0x20" edc:por="------------00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHH0" edc:desc="" edc:mask="0x1" edc:name="CHH0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH1" edc:desc="" edc:mask="0x1" edc:name="CHH1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH2" edc:desc="" edc:mask="0x1" edc:name="CHH2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH3" edc:desc="" edc:mask="0x1" edc:name="CHH3" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH4" edc:desc="" edc:mask="0x1" edc:name="CHH4" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH5" edc:desc="" edc:mask="0x1" edc:name="CHH5" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH6" edc:desc="" edc:mask="0x1" edc:name="CHH6" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH7" edc:desc="" edc:mask="0x1" edc:name="CHH7" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH8" edc:desc="" edc:mask="0x1" edc:name="CHH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH9" edc:desc="" edc:mask="0x1" edc:name="CHH9" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH10" edc:desc="" edc:mask="0x1" edc:name="CHH10" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH11" edc:desc="" edc:mask="0x1" edc:name="CHH11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH12" edc:desc="" edc:mask="0x1" edc:name="CHH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH13" edc:desc="" edc:mask="0x1" edc:name="CHH13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH14" edc:desc="" edc:mask="0x1" edc:name="CHH14" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH15" edc:desc="" edc:mask="0x1" edc:name="CHH15" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CHH16" edc:mask="0x1" edc:name="CHH16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHH17" edc:mask="0x1" edc:name="CHH17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHH18" edc:mask="0x1" edc:name="CHH18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHH19" edc:mask="0x1" edc:name="CHH19" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
